/**Ease枚举*/
export enum TweenEase {
    //http://robertpenner.com/easing/easing_demo.html
    None = 0,
    linearNone = 1,//定义无加速持续运动。
    linearIn = 2,//定义无加速持续运动。
    linearInOut = 3,//定义无加速持续运动。
    linearOut = 4,//定义无加速持续运动。
    bounceIn = 5,//方法以零速率开始运动，然后在执行时加快运动速度。
    bounceInOut = 6,//开始运动时速率为零，先对运动进行加速，再减速直到速率为零。
    bounceOut = 7,//以较快速度开始运动，然后在执行时减慢运动速度，直至速率为零。
    backIn = 8,//开始时往后运动，然后反向朝目标移动。
    backInOut = 9,//开始运动时是向后跟踪，再倒转方向并朝目标移动，稍微过冲目标，然后再次倒转方向，回来朝目标移动。
    backOut = 10,//开始运动时是朝目标移动，稍微过冲，再倒转方向回来朝着目标。
    elasticIn = 11,//方法以零速率开始运动，然后在执行时加快运动速度。
    elasticInOut = 12,//开始运动时速率为零，先对运动进行加速，再减速直到速率为零。
    elasticOut = 13,//以较快速度开始运动，然后在执行时减慢运动速度，直至速率为零。
    strongIn = 14,//以零速率开始运动，然后在执行时加快运动速度。
    strongInOut = 15,//开始运动时速率为零，先对运动进行加速，再减速直到速率为零。
    strongOut = 16,//以较快速度开始运动，然后在执行时减慢运动速度，直至速率为零。
    sineInOut = 17,//开始运动时速率为零，先对运动进行加速，再减速直到速率为零。
    sineIn = 18,//以零速率开始运动，然后在执行时加快运动速度。
    sineOut = 19,//以较快速度开始运动，然后在执行时减慢运动速度，直至速率为零。
    quintIn = 20,//以零速率开始运动，然后在执行时加快运动速度。
    quintInOut = 21,//开始运动时速率为零，先对运动进行加速，再减速直到速率为零。
    quintOut = 22,//以较快速度开始运动，然后在执行时减慢运动速度，直至速率为零。
    quartIn = 23,//方法以零速率开始运动，然后在执行时加快运动速度。
    quartInOut = 24,//开始运动时速率为零，先对运动进行加速，再减速直到速率为零。
    quartOut = 25,//以较快速度开始运动，然后在执行时减慢运动速度，直至速率为零。
    cubicIn = 26,//方法以零速率开始运动，然后在执行时加快运动速度。
    cubicInOut = 27,//开始运动时速率为零，先对运动进行加速，再减速直到速率为零。
    cubicOut = 28,//以较快速度开始运动，然后在执行时减慢运动速度，直至速率为零。
    quadIn = 29,//方法以零速率开始运动，然后在执行时加快运动速度。
    quadInOut = 30,//开始运动时速率为零，先对运动进行加速，再减速直到速率为零。
    quadOut = 31,//以较快速度开始运动，然后在执行时减慢运动速度，直至速率为零。
    expoIn = 32,//方法以零速率开始运动，然后在执行时加快运动速度。
    expoInOut = 33,//开始运动时速率为零，先对运动进行加速，再减速直到速率为零。
    expoOut = 34,//以较快速度开始运动，然后在执行时减慢运动速度，直至速率为零。
    circIn = 35,//方法以零速率开始运动，然后在执行时加快运动速度。
    circInOut = 36,//开始运动时速率为零，先对运动进行加速，再减速直到速率为零。
    circOut = 37,//以较快速度开始运动，然后在执行时减慢运动速度，直至速率为零。
}
